Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDam_reg.h
/**
 * \file IfxDam_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-01 09:51:34 GMT
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Dam_Cfg Dam address
 * \ingroup IfxLld_Dam
 * 
 * \defgroup IfxLld_Dam_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Dam_Cfg
 *
 * \defgroup IfxLld_Dam_Cfg_Dam0 2-DAM0
 * \ingroup IfxLld_Dam_Cfg
 *
 * \defgroup IfxLld_Dam_Cfg_Dam1 2-DAM1
 * \ingroup IfxLld_Dam_Cfg
 *
 *
 */
#ifndef IFXDAM_REG_H
#define IFXDAM_REG_H 1
/******************************************************************************/
#include "IfxDam_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Dam_Cfg_BaseAddress
 * \{  */

/** \brief DAM object */
#define MODULE_DAM0 /*lint --e(923)*/ ((*(Ifx_DAM*)0xF8500000u))
#define MODULE_DAM1 /*lint --e(923)*/ ((*(Ifx_DAM*)0xF8510000u))
/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dam_Cfg_Dam0
 * \{  */
/** \brief 0, ${LMU_instance_name}Clock Control Register */
#define DAM0_CLC /*lint --e(923)*/ (*(volatile Ifx_DAM_CLC*)0xF8500000u)

/** \brief 8, ${LMU_instance_name}Module ID Register */
#define DAM0_MODID /*lint --e(923)*/ (*(volatile Ifx_DAM_MODID*)0xF8500008u)

/** \brief 10, ${LMU_instance_name}Access Enable Register 0 */
#define DAM0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_DAM_ACCEN0*)0xF8500010u)

/** \brief 14, ${LMU_instance_name}Access Enable Register 1 */
#define DAM0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_DAM_ACCEN1*)0xF8500014u)

/** \brief 20, ${Mod_Name}Memory Control Register */
#define DAM0_MEMCON /*lint --e(923)*/ (*(volatile Ifx_DAM_MEMCON*)0xF8500020u)

/** \brief 24, ${LMU_instance_name}Safety Control Register */
#define DAM0_SCTRL /*lint --e(923)*/ (*(volatile Ifx_DAM_SCTRL*)0xF8500024u)

/** \brief 50, ${LMU_instance_name}Region Lower Address Register */
#define DAM0_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8500050u)
/** Alias (User Manual Name) for DAM0_RGN0_LA.
* To use register names with standard convension, please use DAM0_RGN0_LA.
*/
#define DAM0_RGNLA0 (DAM0_RGN0_LA)

/** \brief 54, ${LMU_instance_name}Region Upper Address Register */
#define DAM0_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8500054u)
/** Alias (User Manual Name) for DAM0_RGN0_UA.
* To use register names with standard convension, please use DAM0_RGN0_UA.
*/
#define DAM0_RGNUA0 (DAM0_RGN0_UA)

/** \brief 58, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM0_RGN0_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8500058u)
/** Alias (User Manual Name) for DAM0_RGN0_ACCENA.
* To use register names with standard convension, please use DAM0_RGN0_ACCENA.
*/
#define DAM0_RGNACCENWA0 (DAM0_RGN0_ACCENA)

/** \brief 5C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM0_RGN0_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF850005Cu)
/** Alias (User Manual Name) for DAM0_RGN0_ACCENB.
* To use register names with standard convension, please use DAM0_RGN0_ACCENB.
*/
#define DAM0_RGNACCENWB0 (DAM0_RGN0_ACCENB)

/** \brief 60, ${LMU_instance_name}Region Lower Address Register */
#define DAM0_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8500060u)
/** Alias (User Manual Name) for DAM0_RGN1_LA.
* To use register names with standard convension, please use DAM0_RGN1_LA.
*/
#define DAM0_RGNLA1 (DAM0_RGN1_LA)

/** \brief 64, ${LMU_instance_name}Region Upper Address Register */
#define DAM0_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8500064u)
/** Alias (User Manual Name) for DAM0_RGN1_UA.
* To use register names with standard convension, please use DAM0_RGN1_UA.
*/
#define DAM0_RGNUA1 (DAM0_RGN1_UA)

/** \brief 68, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM0_RGN1_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8500068u)
/** Alias (User Manual Name) for DAM0_RGN1_ACCENA.
* To use register names with standard convension, please use DAM0_RGN1_ACCENA.
*/
#define DAM0_RGNACCENWA1 (DAM0_RGN1_ACCENA)

/** \brief 6C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM0_RGN1_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF850006Cu)
/** Alias (User Manual Name) for DAM0_RGN1_ACCENB.
* To use register names with standard convension, please use DAM0_RGN1_ACCENB.
*/
#define DAM0_RGNACCENWB1 (DAM0_RGN1_ACCENB)

/** \brief 70, ${LMU_instance_name}Region Lower Address Register */
#define DAM0_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8500070u)
/** Alias (User Manual Name) for DAM0_RGN2_LA.
* To use register names with standard convension, please use DAM0_RGN2_LA.
*/
#define DAM0_RGNLA2 (DAM0_RGN2_LA)

/** \brief 74, ${LMU_instance_name}Region Upper Address Register */
#define DAM0_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8500074u)
/** Alias (User Manual Name) for DAM0_RGN2_UA.
* To use register names with standard convension, please use DAM0_RGN2_UA.
*/
#define DAM0_RGNUA2 (DAM0_RGN2_UA)

/** \brief 78, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM0_RGN2_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8500078u)
/** Alias (User Manual Name) for DAM0_RGN2_ACCENA.
* To use register names with standard convension, please use DAM0_RGN2_ACCENA.
*/
#define DAM0_RGNACCENWA2 (DAM0_RGN2_ACCENA)

/** \brief 7C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM0_RGN2_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF850007Cu)
/** Alias (User Manual Name) for DAM0_RGN2_ACCENB.
* To use register names with standard convension, please use DAM0_RGN2_ACCENB.
*/
#define DAM0_RGNACCENWB2 (DAM0_RGN2_ACCENB)

/** \brief 80, ${LMU_instance_name}Region Lower Address Register */
#define DAM0_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8500080u)
/** Alias (User Manual Name) for DAM0_RGN3_LA.
* To use register names with standard convension, please use DAM0_RGN3_LA.
*/
#define DAM0_RGNLA3 (DAM0_RGN3_LA)

/** \brief 84, ${LMU_instance_name}Region Upper Address Register */
#define DAM0_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8500084u)
/** Alias (User Manual Name) for DAM0_RGN3_UA.
* To use register names with standard convension, please use DAM0_RGN3_UA.
*/
#define DAM0_RGNUA3 (DAM0_RGN3_UA)

/** \brief 88, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM0_RGN3_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8500088u)
/** Alias (User Manual Name) for DAM0_RGN3_ACCENA.
* To use register names with standard convension, please use DAM0_RGN3_ACCENA.
*/
#define DAM0_RGNACCENWA3 (DAM0_RGN3_ACCENA)

/** \brief 8C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM0_RGN3_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF850008Cu)
/** Alias (User Manual Name) for DAM0_RGN3_ACCENB.
* To use register names with standard convension, please use DAM0_RGN3_ACCENB.
*/
#define DAM0_RGNACCENWB3 (DAM0_RGN3_ACCENB)

/** \brief 90, ${LMU_instance_name}Region Lower Address Register */
#define DAM0_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8500090u)
/** Alias (User Manual Name) for DAM0_RGN4_LA.
* To use register names with standard convension, please use DAM0_RGN4_LA.
*/
#define DAM0_RGNLA4 (DAM0_RGN4_LA)

