Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDam_reg.h
/** \brief 12C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM0_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850012Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN5_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN5_RB.
*/
#define DAM0_RGNACCENRB5 (DAM0_RGNACCEN5_RB)

/** \brief 138, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM0_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8500138u)
/** Alias (User Manual Name) for DAM0_RGNACCEN6_RA.
* To use register names with standard convension, please use DAM0_RGNACCEN6_RA.
*/
#define DAM0_RGNACCENRA6 (DAM0_RGNACCEN6_RA)

/** \brief 13C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM0_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850013Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN6_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN6_RB.
*/
#define DAM0_RGNACCENRB6 (DAM0_RGNACCEN6_RB)

/** \brief 148, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM0_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8500148u)
/** Alias (User Manual Name) for DAM0_RGNACCEN7_RA.
* To use register names with standard convension, please use DAM0_RGNACCEN7_RA.
*/
#define DAM0_RGNACCENRA7 (DAM0_RGNACCEN7_RA)

/** \brief 14C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM0_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF850014Cu)
/** Alias (User Manual Name) for DAM0_RGNACCEN7_RB.
* To use register names with standard convension, please use DAM0_RGNACCEN7_RB.
*/
#define DAM0_RGNACCENRB7 (DAM0_RGNACCEN7_RB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dam_Cfg_Dam1
 * \{  */
/** \brief 0, ${LMU_instance_name}Clock Control Register */
#define DAM1_CLC /*lint --e(923)*/ (*(volatile Ifx_DAM_CLC*)0xF8510000u)

/** \brief 8, ${LMU_instance_name}Module ID Register */
#define DAM1_MODID /*lint --e(923)*/ (*(volatile Ifx_DAM_MODID*)0xF8510008u)

/** \brief 10, ${LMU_instance_name}Access Enable Register 0 */
#define DAM1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_DAM_ACCEN0*)0xF8510010u)

/** \brief 14, ${LMU_instance_name}Access Enable Register 1 */
#define DAM1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_DAM_ACCEN1*)0xF8510014u)

/** \brief 20, ${Mod_Name}Memory Control Register */
#define DAM1_MEMCON /*lint --e(923)*/ (*(volatile Ifx_DAM_MEMCON*)0xF8510020u)

/** \brief 24, ${LMU_instance_name}Safety Control Register */
#define DAM1_SCTRL /*lint --e(923)*/ (*(volatile Ifx_DAM_SCTRL*)0xF8510024u)

/** \brief 50, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510050u)
/** Alias (User Manual Name) for DAM1_RGN0_LA.
* To use register names with standard convension, please use DAM1_RGN0_LA.
*/
#define DAM1_RGNLA0 (DAM1_RGN0_LA)

/** \brief 54, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510054u)
/** Alias (User Manual Name) for DAM1_RGN0_UA.
* To use register names with standard convension, please use DAM1_RGN0_UA.
*/
#define DAM1_RGNUA0 (DAM1_RGN0_UA)

/** \brief 58, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN0_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510058u)
/** Alias (User Manual Name) for DAM1_RGN0_ACCENA.
* To use register names with standard convension, please use DAM1_RGN0_ACCENA.
*/
#define DAM1_RGNACCENWA0 (DAM1_RGN0_ACCENA)

/** \brief 5C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN0_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851005Cu)
/** Alias (User Manual Name) for DAM1_RGN0_ACCENB.
* To use register names with standard convension, please use DAM1_RGN0_ACCENB.
*/
#define DAM1_RGNACCENWB0 (DAM1_RGN0_ACCENB)

/** \brief 60, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510060u)
/** Alias (User Manual Name) for DAM1_RGN1_LA.
* To use register names with standard convension, please use DAM1_RGN1_LA.
*/
#define DAM1_RGNLA1 (DAM1_RGN1_LA)

/** \brief 64, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510064u)
/** Alias (User Manual Name) for DAM1_RGN1_UA.
* To use register names with standard convension, please use DAM1_RGN1_UA.
*/
#define DAM1_RGNUA1 (DAM1_RGN1_UA)

/** \brief 68, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN1_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510068u)
/** Alias (User Manual Name) for DAM1_RGN1_ACCENA.
* To use register names with standard convension, please use DAM1_RGN1_ACCENA.
*/
#define DAM1_RGNACCENWA1 (DAM1_RGN1_ACCENA)

/** \brief 6C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN1_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851006Cu)
/** Alias (User Manual Name) for DAM1_RGN1_ACCENB.
* To use register names with standard convension, please use DAM1_RGN1_ACCENB.
*/
#define DAM1_RGNACCENWB1 (DAM1_RGN1_ACCENB)

/** \brief 70, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510070u)
/** Alias (User Manual Name) for DAM1_RGN2_LA.
* To use register names with standard convension, please use DAM1_RGN2_LA.
*/
#define DAM1_RGNLA2 (DAM1_RGN2_LA)

/** \brief 74, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510074u)
/** Alias (User Manual Name) for DAM1_RGN2_UA.
* To use register names with standard convension, please use DAM1_RGN2_UA.
*/
#define DAM1_RGNUA2 (DAM1_RGN2_UA)

/** \brief 78, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN2_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510078u)
/** Alias (User Manual Name) for DAM1_RGN2_ACCENA.
* To use register names with standard convension, please use DAM1_RGN2_ACCENA.
*/
#define DAM1_RGNACCENWA2 (DAM1_RGN2_ACCENA)

/** \brief 7C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN2_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851007Cu)
/** Alias (User Manual Name) for DAM1_RGN2_ACCENB.
* To use register names with standard convension, please use DAM1_RGN2_ACCENB.
*/
#define DAM1_RGNACCENWB2 (DAM1_RGN2_ACCENB)

/** \brief 80, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510080u)
/** Alias (User Manual Name) for DAM1_RGN3_LA.
* To use register names with standard convension, please use DAM1_RGN3_LA.
*/
#define DAM1_RGNLA3 (DAM1_RGN3_LA)

/** \brief 84, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510084u)
/** Alias (User Manual Name) for DAM1_RGN3_UA.
* To use register names with standard convension, please use DAM1_RGN3_UA.
*/
#define DAM1_RGNUA3 (DAM1_RGN3_UA)

/** \brief 88, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN3_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510088u)
/** Alias (User Manual Name) for DAM1_RGN3_ACCENA.
* To use register names with standard convension, please use DAM1_RGN3_ACCENA.
*/
#define DAM1_RGNACCENWA3 (DAM1_RGN3_ACCENA)

/** \brief 8C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN3_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851008Cu)
/** Alias (User Manual Name) for DAM1_RGN3_ACCENB.
* To use register names with standard convension, please use DAM1_RGN3_ACCENB.
*/
#define DAM1_RGNACCENWB3 (DAM1_RGN3_ACCENB)

/** \brief 90, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF8510090u)
/** Alias (User Manual Name) for DAM1_RGN4_LA.
* To use register names with standard convension, please use DAM1_RGN4_LA.
*/
#define DAM1_RGNLA4 (DAM1_RGN4_LA)

