Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDam_reg.h
/** \brief 94, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF8510094u)
/** Alias (User Manual Name) for DAM1_RGN4_UA.
* To use register names with standard convension, please use DAM1_RGN4_UA.
*/
#define DAM1_RGNUA4 (DAM1_RGN4_UA)

/** \brief 98, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN4_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF8510098u)
/** Alias (User Manual Name) for DAM1_RGN4_ACCENA.
* To use register names with standard convension, please use DAM1_RGN4_ACCENA.
*/
#define DAM1_RGNACCENWA4 (DAM1_RGN4_ACCENA)

/** \brief 9C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN4_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF851009Cu)
/** Alias (User Manual Name) for DAM1_RGN4_ACCENB.
* To use register names with standard convension, please use DAM1_RGN4_ACCENB.
*/
#define DAM1_RGNACCENWB4 (DAM1_RGN4_ACCENB)

/** \brief A0, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF85100A0u)
/** Alias (User Manual Name) for DAM1_RGN5_LA.
* To use register names with standard convension, please use DAM1_RGN5_LA.
*/
#define DAM1_RGNLA5 (DAM1_RGN5_LA)

/** \brief A4, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF85100A4u)
/** Alias (User Manual Name) for DAM1_RGN5_UA.
* To use register names with standard convension, please use DAM1_RGN5_UA.
*/
#define DAM1_RGNUA5 (DAM1_RGN5_UA)

/** \brief A8, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN5_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF85100A8u)
/** Alias (User Manual Name) for DAM1_RGN5_ACCENA.
* To use register names with standard convension, please use DAM1_RGN5_ACCENA.
*/
#define DAM1_RGNACCENWA5 (DAM1_RGN5_ACCENA)

/** \brief AC, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN5_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF85100ACu)
/** Alias (User Manual Name) for DAM1_RGN5_ACCENB.
* To use register names with standard convension, please use DAM1_RGN5_ACCENB.
*/
#define DAM1_RGNACCENWB5 (DAM1_RGN5_ACCENB)

/** \brief B0, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF85100B0u)
/** Alias (User Manual Name) for DAM1_RGN6_LA.
* To use register names with standard convension, please use DAM1_RGN6_LA.
*/
#define DAM1_RGNLA6 (DAM1_RGN6_LA)

/** \brief B4, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF85100B4u)
/** Alias (User Manual Name) for DAM1_RGN6_UA.
* To use register names with standard convension, please use DAM1_RGN6_UA.
*/
#define DAM1_RGNUA6 (DAM1_RGN6_UA)

/** \brief B8, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN6_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF85100B8u)
/** Alias (User Manual Name) for DAM1_RGN6_ACCENA.
* To use register names with standard convension, please use DAM1_RGN6_ACCENA.
*/
#define DAM1_RGNACCENWA6 (DAM1_RGN6_ACCENA)

/** \brief BC, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN6_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF85100BCu)
/** Alias (User Manual Name) for DAM1_RGN6_ACCENB.
* To use register names with standard convension, please use DAM1_RGN6_ACCENB.
*/
#define DAM1_RGNACCENWB6 (DAM1_RGN6_ACCENB)

/** \brief C0, ${LMU_instance_name}Region Lower Address Register */
#define DAM1_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_LA*)0xF85100C0u)
/** Alias (User Manual Name) for DAM1_RGN7_LA.
* To use register names with standard convension, please use DAM1_RGN7_LA.
*/
#define DAM1_RGNLA7 (DAM1_RGN7_LA)

/** \brief C4, ${LMU_instance_name}Region Upper Address Register */
#define DAM1_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_UA*)0xF85100C4u)
/** Alias (User Manual Name) for DAM1_RGN7_UA.
* To use register names with standard convension, please use DAM1_RGN7_UA.
*/
#define DAM1_RGNUA7 (DAM1_RGN7_UA)

/** \brief C8, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGN7_ACCENA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENA*)0xF85100C8u)
/** Alias (User Manual Name) for DAM1_RGN7_ACCENA.
* To use register names with standard convension, please use DAM1_RGN7_ACCENA.
*/
#define DAM1_RGNACCENWA7 (DAM1_RGN7_ACCENA)

/** \brief CC, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGN7_ACCENB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGN_ACCENB*)0xF85100CCu)
/** Alias (User Manual Name) for DAM1_RGN7_ACCENB.
* To use register names with standard convension, please use DAM1_RGN7_ACCENB.
*/
#define DAM1_RGNACCENWB7 (DAM1_RGN7_ACCENB)

/** \brief D8, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF85100D8u)
/** Alias (User Manual Name) for DAM1_RGNACCEN0_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN0_RA.
*/
#define DAM1_RGNACCENRA0 (DAM1_RGNACCEN0_RA)

/** \brief DC, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF85100DCu)
/** Alias (User Manual Name) for DAM1_RGNACCEN0_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN0_RB.
*/
#define DAM1_RGNACCENRB0 (DAM1_RGNACCEN0_RB)

/** \brief E8, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF85100E8u)
/** Alias (User Manual Name) for DAM1_RGNACCEN1_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN1_RA.
*/
#define DAM1_RGNACCENRA1 (DAM1_RGNACCEN1_RA)

/** \brief EC, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF85100ECu)
/** Alias (User Manual Name) for DAM1_RGNACCEN1_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN1_RB.
*/
#define DAM1_RGNACCENRB1 (DAM1_RGNACCEN1_RB)

/** \brief F8, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF85100F8u)
/** Alias (User Manual Name) for DAM1_RGNACCEN2_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN2_RA.
*/
#define DAM1_RGNACCENRA2 (DAM1_RGNACCEN2_RA)

/** \brief FC, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF85100FCu)
/** Alias (User Manual Name) for DAM1_RGNACCEN2_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN2_RB.
*/
#define DAM1_RGNACCENRB2 (DAM1_RGNACCEN2_RB)

/** \brief 108, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510108u)
/** Alias (User Manual Name) for DAM1_RGNACCEN3_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN3_RA.
*/
#define DAM1_RGNACCENRA3 (DAM1_RGNACCEN3_RA)

/** \brief 10C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851010Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN3_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN3_RB.
*/
#define DAM1_RGNACCENRB3 (DAM1_RGNACCEN3_RB)

/** \brief 118, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510118u)
/** Alias (User Manual Name) for DAM1_RGNACCEN4_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN4_RA.
*/
#define DAM1_RGNACCENRA4 (DAM1_RGNACCEN4_RA)

/** \brief 11C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851011Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN4_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN4_RB.
*/
#define DAM1_RGNACCENRB4 (DAM1_RGNACCEN4_RB)

/** \brief 128, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510128u)
/** Alias (User Manual Name) for DAM1_RGNACCEN5_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN5_RA.
*/
#define DAM1_RGNACCENRA5 (DAM1_RGNACCEN5_RA)

