Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDam_reg.h
/** \brief 12C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851012Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN5_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN5_RB.
*/
#define DAM1_RGNACCENRB5 (DAM1_RGNACCEN5_RB)

/** \brief 138, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510138u)
/** Alias (User Manual Name) for DAM1_RGNACCEN6_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN6_RA.
*/
#define DAM1_RGNACCENRA6 (DAM1_RGNACCEN6_RA)

/** \brief 13C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851013Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN6_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN6_RB.
*/
#define DAM1_RGNACCENRB6 (DAM1_RGNACCEN6_RB)

/** \brief 148, ${LMU_instance_name}Region Access Enable Register 0 */
#define DAM1_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RA*)0xF8510148u)
/** Alias (User Manual Name) for DAM1_RGNACCEN7_RA.
* To use register names with standard convension, please use DAM1_RGNACCEN7_RA.
*/
#define DAM1_RGNACCENRA7 (DAM1_RGNACCEN7_RA)

/** \brief 14C, ${LMU_instance_name}Region Access Enable Register 1 */
#define DAM1_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_DAM_RGNACCEN_RB*)0xF851014Cu)
/** Alias (User Manual Name) for DAM1_RGNACCEN7_RB.
* To use register names with standard convension, please use DAM1_RGNACCEN7_RB.
*/
#define DAM1_RGNACCENRB7 (DAM1_RGNACCEN7_RB)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDAM_REG_H */
